Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
         - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2"
        name        = "sbeacon-backend-getGenomicVariants-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2339553450177143316" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1741839939549939000" -> "1747637405877108000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getIndividuals"
        name              = "/aws/lambda/sbeacon-backend-getIndividuals"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getIndividuals"
        name                  = "sbeacon-backend-getIndividuals"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0"
        name        = "sbeacon-backend-getIndividuals-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-splitQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:307946671795:splitQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1"
        name        = "sbeacon-backend-getIndividuals-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2"
        name        = "sbeacon-backend-getIndividuals-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4517256966604802575" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1741839939147191000" -> "1747637405091177000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getInfo"
        name              = "/aws/lambda/sbeacon-backend-getInfo"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getInfo.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getInfo"
        name                  = "sbeacon-backend-getInfo"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4876647070049565482" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1738034154077949000" -> "1747637405823179000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getMap"
        name              = "/aws/lambda/sbeacon-backend-getMap"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getMap.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getMap"
        name                  = "sbeacon-backend-getMap"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6918035064034099323" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733455535890647000" -> "1747637405025040000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getProjects"
        name              = "/aws/lambda/sbeacon-backend-getProjects"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getProjects.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getProjects"
        name                  = "sbeacon-backend-getProjects"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getProjects:sbeacon-backend-getProjects-0"
        name        = "sbeacon-backend-getProjects-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4967106887033753149" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739862262583653000" -> "1747637405428440000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getRuns"
        name              = "/aws/lambda/sbeacon-backend-getRuns"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getRuns"
        name                  = "sbeacon-backend-getRuns"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getRuns:sbeacon-backend-getRuns-0"
        name        = "sbeacon-backend-getRuns-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-splitQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:307946671795:splitQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getRuns:sbeacon-backend-getRuns-1"
        name        = "sbeacon-backend-getRuns-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getRuns:sbeacon-backend-getRuns-2"
        name        = "sbeacon-backend-getRuns-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2277336914220302028" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1741839939030485000" -> "1747637404423894000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-indexer"
        name              = "/aws/lambda/sbeacon-backend-indexer"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-indexer"
        name                  = "sbeacon-backend-indexer"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-0"
        name        = "sbeacon-backend-indexer-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-1"
        name        = "sbeacon-backend-indexer-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-2"
        name        = "sbeacon-backend-indexer-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[3] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-3"
        name        = "sbeacon-backend-indexer-3"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-mutex-locks"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "415638914788014811" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747627139826107000" -> "1747637405425210000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-performQuery"
        name              = "/aws/lambda/sbeacon-backend-performQuery"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-performQuery"
        name                  = "sbeacon-backend-performQuery"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:43",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6272573112680799629" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742271411147811000" -> "1747637405028308000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-splitQuery"
        name              = "/aws/lambda/sbeacon-backend-splitQuery"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-splitQuery"
        name                  = "sbeacon-backend-splitQuery"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-splitQuery:sbeacon-backend-splitQuery"
        name        = "sbeacon-backend-splitQuery"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-performQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:307946671795:performQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7286176147394092439" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742271411208420000" -> "1747637404530829000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-submitDataset"
        name              = "/aws/lambda/sbeacon-backend-submitDataset"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-submitDataset"
        name                  = "sbeacon-backend-submitDataset"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-1"
        name        = "sbeacon-backend-submitDataset-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-2"
        name        = "sbeacon-backend-submitDataset-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[3] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-3"
        name        = "sbeacon-backend-submitDataset-3"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:82425c0ab105331b2b2ceed544d6bab0b930551a271b9c3a1e46443824837d39" -> (known after apply)
      ~ last_modified                  = "2025-05-19T04:14:39.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-updateFiles"
        name              = "/aws/lambda/sbeacon-backend-updateFiles"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-updateFiles"
        name                  = "sbeacon-backend-updateFiles"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-updateFiles:sbeacon-backend-updateFiles"
        name        = "sbeacon-backend-updateFiles"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:43",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:23",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "sbeacon-backend"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3702384137061299953" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742271410917913000" -> "1747637404533296200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46" -> (known after apply)
      ~ code_sha256                 = "ig6dlIJWB5L7nLS03rZsVPEqHPeCuWuwpkaPaAwYtl0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-19T04:03:54.381+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:46" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/e0440c75d4870d1ca6c3806ebc333c54e75a1ce328df2ec68b92a8cd308ca7ba.zip" -> "builds/0e988de02bb6132b560d2df9e534a34a14266ddba1e9b18cb15bf7082539a962.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23788993 -> (known after apply)
      ~ version                     = "46" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250110044710445300000003/builds/e0440c75d4870d1ca6c3806ebc333c54e75a1ce328df2ec68b92a8cd308ca7ba.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "b9a67c2de8fc3deb16b3a283634a6f6a-5" -> (known after apply)
      ~ id                            = "builds/e0440c75d4870d1ca6c3806ebc333c54e75a1ce328df2ec68b92a8cd308ca7ba.zip" -> (known after apply)
      ~ key                           = "builds/e0440c75d4870d1ca6c3806ebc333c54e75a1ce328df2ec68b92a8cd308ca7ba.zip" -> "builds/0e988de02bb6132b560d2df9e534a34a14266ddba1e9b18cb15bf7082539a962.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/e0440c75d4870d1ca6c3806ebc333c54e75a1ce328df2ec68b92a8cd308ca7ba.zip" -> "builds/0e988de02bb6132b560d2df9e534a34a14266ddba1e9b18cb15bf7082539a962.zip"
      - tags                          = {
          - "Environment" = "STAGING"
          - "Owner"       = "GXC"
        } -> null
      ~ tags_all                      = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0e988de02bb6132b560d2df9e534a34a14266ddba1e9b18cb15bf7082539a962.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0e988de02bb6132b560d2df9e534a34a14266ddba1e9b18cb15bf7082539a962.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "267666981175525798" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e0440c75d4870d1ca6c3806ebc333c54e75a1ce328df2ec68b92a8cd308ca7ba.zip" -> "builds/0e988de02bb6132b560d2df9e534a34a14266ddba1e9b18cb15bf7082539a962.zip"
          ~ "timestamp" = "1741235298806574200" -> "1747637421669128000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] will be updated in-place
  ~ resource "aws_s3_object" "lambda_package" {
        id                            = "builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip"
      ~ tags                          = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                      = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (26 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7490597099670326433" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747627138662962000" -> "1747637405484015000"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/security-sendSecurityAlert"
        name              = "/aws/lambda/security-sendSecurityAlert"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "security-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "security-sendSecurityAlert"
        name                  = "security-sendSecurityAlert"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "security-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "security-sendSecurityAlert"
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "security-infrastructure"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GASPI_ADMIN_EMAIL" = "nick.edwards@csiro.au" -> "devops@xapiens.id"
              ~ "SES_SOURCE_EMAIL"  = "dian.larasaty@xapiens.id" -> "no.reply.gaspi.notifications@gmail.com"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6287502616456555152" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747627139010521000" -> "1747637405943106000"
            # (1 unchanged element hidden)
        }
    }

Plan: 41 to add, 160 to change, 36 to destroy.

Changes to Outputs:
  ~ guest_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_1pggQ2ofX --region ap-southeast-3 --client-id h0fgvvsvfu9lvaj4mluffgsfg --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest@Example123! --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_1pggQ2ofX --region ap-southeast-3 --client-id h0fgvvsvfu9lvaj4mluffgsfg --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=guest1234 --output json --query AuthenticationResult.IdToken"
╷
│ Warning: Deprecated attribute
│ 
│   on pgxflow/cloudfront.tf line 45, in resource "aws_cloudfront_distribution" "api_distribution":
│   45:     domain_name = split("/", aws_api_gateway_deployment.PgxApi.invoke_url)[2]
│ 
│ The attribute "invoke_url" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Error: Invalid value for variable
│ 
│   on variables.tf line 128:
│  128: variable "hub_name" {
│     ├────────────────
│     │ var.hub_name is "NONE"
│ 
│ hub_name must be one of: RSCM, RSSARDJITO, RSPON, RSIGNG, RSJPD
│ 
│ This was checked by the validation rule at variables.tf:133,3-13.
╵


```
</details>